
## Plan Result (feature-flags-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/29467)


<pre><code>Plan: 45 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_acm_certificate.application_alb_certificate_93966247
  * aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195
  * aws_alb.application_application_load_balancer_alb_05EA9801
  * aws_alb_listener.application_listener_http_D74EC0ED
  * aws_alb_listener.application_listener_https_D31CB055
  * aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F
  * aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B
  * aws_alb_target_group.application_ecs_service_green_target_group_ecs_target_group_4E06DCA6
  * aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511
  * aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2
  * aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99
  * aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED
  * aws_cloudwatch_log_group.application_ecs_service_ecs-app_DB3BB2A9
  * aws_cloudwatch_log_group.application_ecs_service_ecs-xray-daemon_963C2C1F
  * aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1
  * aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0
  * aws_codedeploy_app.application_ecs_service_ecs_codedeploy_ecs_code_deploy_C2F7CBCF
  * aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247
  * aws_codestarnotifications_notification_rule.application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE
  * aws_db_subnet_group.rds_rds_subnet_group_796D20B7
  * aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7
  * aws_ecr_repository.application_ecs_service_ecr-app_ecr-repo_ABFE17F0
  * aws_ecs_cluster.application_ecs_cluster_4DC6EFB3
  * aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4
  * aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77
  * aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6
  * aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA
  * aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED
  * aws_iam_role.application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_175DB7D3
  * aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355
  * aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E
  * aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF
  * aws_iam_role_policy_attachment.application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_1A1D5725
  * aws_rds_cluster.rds_rds_cluster_1A0399FD
  * aws_route53_record.application_alb_certificate_certificate_record_51B45CF2
  * aws_route53_record.application_alb_record_8EA9D3F9
  * aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22
  * aws_route53_zone.application_base_dns_subhosted_zone_77521D1C
  * aws_secretsmanager_secret.rds_rds_secret_A0401B27
  * aws_secretsmanager_secret_version.rds_rds_secret_version_11D8C2B1
  * aws_security_group.application_application_load_balancer_alb_security_group_7B45D070
  * aws_security_group.application_ecs_service_ecs_security_group_231C6B1E
  * aws_security_group.rds_rds_security_group_B7738CEB
  * local_file.application_ecs_service_appspec_94386B9C


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_acm_certificate.application_alb_certificate_93966247 will be created
  + resource "aws_acm_certificate" "application_alb_certificate_93966247" {
      + arn                       = (known after apply)
      + domain_name               = "featureflags.readitlater.com"
      + domain_validation_options = [
          + {
              + domain_name           = "featureflags.readitlater.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "featureflags.readitlater.com",
        ]
      + tags                      = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + tags_all                  = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195 will be created
  + resource "aws_acm_certificate_validation" "application_alb_certificate_certificate_validation_25DAB195" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_alb.application_application_load_balancer_alb_05EA9801 will be created
  + resource "aws_alb" "application_application_load_balancer_alb_05EA9801" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = (known after apply)
      + name_prefix                                                  = "FFLAGS"
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-36c2611d",
          + "subnet-420db61b",
          + "subnet-5a0f952d",
          + "subnet-6b400e51",
        ]
      + tags                                                         = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + tags_all                                                     = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # aws_alb_listener.application_listener_http_D74EC0ED will be created
  + resource "aws_alb_listener" "application_listener_http_D74EC0ED" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + tags_all          = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # aws_alb_listener.application_listener_https_D31CB055 will be created
  + resource "aws_alb_listener" "application_listener_https_D31CB055" {
      + arn               = (known after apply)
      + certificate_arn   = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-TLS-1-1-2017-01"
      + tags              = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + tags_all          = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + status_code  = "503"
            }
        }
    }

  # aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F will be created
  + resource "aws_alb_listener_rule" "application_ecs_service_listener_rule_903F815F" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 1
      + tags         = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + tags_all     = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B will be created
  + resource "aws_alb_target_group" "application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "120"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = "FFLAGS"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
          + "type"        = "blue"
        }
      + tags_all                           = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
          + "type"        = "blue"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-867638e3"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 15
          + matcher             = (known after apply)
          + path                = "/.well-known/apollo/server-health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }
    }

  # aws_alb_target_group.application_ecs_service_green_target_group_ecs_target_group_4E06DCA6 will be created
  + resource "aws_alb_target_group" "application_ecs_service_green_target_group_ecs_target_group_4E06DCA6" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "120"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = "FFLAGS"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
          + "type"        = "green"
        }
      + tags_all                           = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
          + "type"        = "green"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-867638e3"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 15
          + matcher             = (known after apply)
          + path                = "/.well-known/apollo/server-health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }
    }

  # aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511 will be created
  + resource "aws_appautoscaling_policy" "application_autoscaling_scale_in_policy_BF273511" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "FeatureFlags-Prod-ScaleInPolicy"
      + policy_type        = "StepScaling"
      + resource_id        = "service/FeatureFlags-Prod/FeatureFlags-Prod"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Average"

          + step_adjustment {
              + metric_interval_upper_bound = "0"
              + scaling_adjustment          = -1
            }
        }
    }

  # aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2 will be created
  + resource "aws_appautoscaling_policy" "application_autoscaling_scale_out_policy_D03900A2" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "FeatureFlags-Prod-ScaleOutPolicy"
      + policy_type        = "StepScaling"
      + resource_id        = "service/FeatureFlags-Prod/FeatureFlags-Prod"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Average"

          + step_adjustment {
              + metric_interval_lower_bound = "0"
              + scaling_adjustment          = 2
            }
        }
    }

  # aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99 will be created
  + resource "aws_appautoscaling_target" "application_autoscaling_autoscaling_target_42BF5C99" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 12
      + min_capacity       = 2
      + resource_id        = "service/FeatureFlags-Prod/FeatureFlags-Prod"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = (known after apply)
    }

  # aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED will be created
  + resource "aws_cloudwatch_dashboard" "application_cloudwatch-dashboard_1F3DC0ED" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = (known after apply)
      + dashboard_name = "FeatureFlags-Prod"
      + id             = (known after apply)
    }

  # aws_cloudwatch_log_group.application_ecs_service_ecs-app_DB3BB2A9 will be created
  + resource "aws_cloudwatch_log_group" "application_ecs_service_ecs-app_DB3BB2A9" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = (known after apply)
      + name_prefix       = "/ecs/FeatureFlags-Prod/app"
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + tags_all          = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
    }

  # aws_cloudwatch_log_group.application_ecs_service_ecs-xray-daemon_963C2C1F will be created
  + resource "aws_cloudwatch_log_group" "application_ecs_service_ecs-xray-daemon_963C2C1F" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = (known after apply)
      + name_prefix       = "/ecs/FeatureFlags-Prod/xray-daemon"
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + tags_all          = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
    }

  # aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1 will be created
  + resource "aws_cloudwatch_metric_alarm" "application_autoscaling_scale_in_alarm_850BE3A1" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alarm to reduce capacity if container CPU is low"
      + alarm_name                            = "FeatureFlags-Prod Service Low CPU"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "FeatureFlags-Prod"
          + "ServiceName" = "FeatureFlags-Prod"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + period                                = 60
      + statistic                             = "Average"
      + tags                                  = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + tags_all                              = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + threshold                             = 30
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0 will be created
  + resource "aws_cloudwatch_metric_alarm" "application_autoscaling_scale_out_alarm_E40FCBA0" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alarm to add capacity if container CPU is high"
      + alarm_name                            = "FeatureFlags-Prod Service High CPU"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "FeatureFlags-Prod"
          + "ServiceName" = "FeatureFlags-Prod"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + period                                = 60
      + statistic                             = "Average"
      + tags                                  = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + tags_all                              = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + threshold                             = 45
      + treat_missing_data                    = "notBreaching"
    }

  # aws_codedeploy_app.application_ecs_service_ecs_codedeploy_ecs_code_deploy_C2F7CBCF will be created
  + resource "aws_codedeploy_app" "application_ecs_service_ecs_codedeploy_ecs_code_deploy_C2F7CBCF" {
      + application_id      = (known after apply)
      + arn                 = (known after apply)
      + compute_platform    = "ECS"
      + github_account_name = (known after apply)
      + id                  = (known after apply)
      + linked_to_github    = (known after apply)
      + name                = "FeatureFlags-Prod-ECS"
      + tags                = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + tags_all            = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
    }

  # aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247 will be created
  + resource "aws_codedeploy_deployment_group" "application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247" {
      + app_name                    = "FeatureFlags-Prod-ECS"
      + arn                         = (known after apply)
      + compute_platform            = (known after apply)
      + deployment_config_name      = "CodeDeployDefault.ECSAllAtOnce"
      + deployment_group_id         = (known after apply)
      + deployment_group_name       = "FeatureFlags-Prod-ECS"
      + id                          = (known after apply)
      + outdated_instances_strategy = "UPDATE"
      + service_role_arn            = (known after apply)
      + tags                        = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + tags_all                    = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }

      + auto_rollback_configuration {
          + enabled = true
          + events  = [
              + "DEPLOYMENT_FAILURE",
            ]
        }

      + blue_green_deployment_config {
          + deployment_ready_option {
              + action_on_timeout = "CONTINUE_DEPLOYMENT"
            }
          + terminate_blue_instances_on_deployment_success {
              + action                           = "TERMINATE"
              + termination_wait_time_in_minutes = 5
            }
        }

      + deployment_style {
          + deployment_option = "WITH_TRAFFIC_CONTROL"
          + deployment_type   = "BLUE_GREEN"
        }

      + ecs_service {
          + cluster_name = "FeatureFlags-Prod"
          + service_name = "FeatureFlags-Prod"
        }

      + load_balancer_info {
          + target_group_pair_info {
              + prod_traffic_route {
                  + listener_arns = (known after apply)
                }
              + target_group {
                  + name = (known after apply)
                }
              + target_group {
                  + name = (known after apply)
                }
            }
        }
    }

  # aws_codestarnotifications_notification_rule.application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE will be created
  + resource "aws_codestarnotifications_notification_rule" "application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE" {
      + arn            = (known after apply)
      + detail_type    = "BASIC"
      + event_type_ids = [
          + "codedeploy-application-deployment-failed",
        ]
      + id             = (known after apply)
      + name           = "FeatureFlags-Prod-ECS"
      + resource       = "arn:aws:codedeploy:us-east-1:996905175585:application:FeatureFlags-Prod-ECS"
      + status         = "ENABLED"
      + tags           = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + tags_all       = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }

      + target {
          + address = "arn:aws:sns:us-east-1:996905175585:Backend-Prod-ChatBot"
          + status  = (known after apply)
          + type    = "SNS"
        }
    }

  # aws_db_subnet_group.rds_rds_subnet_group_796D20B7 will be created
  + resource "aws_db_subnet_group" "rds_rds_subnet_group_796D20B7" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = (known after apply)
      + name_prefix             = (known after apply)
      + subnet_ids              = [
          + "subnet-610bdb3b",
          + "subnet-b2a036fa",
          + "subnet-cc66bde0",
          + "subnet-d09eb8ec",
        ]
      + supported_network_types = (known after apply)
      + tags                    = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + tags_all                = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + vpc_id                  = (known after apply)
    }

  # aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7 will be created
  + resource "aws_ecr_lifecycle_policy" "application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "expire old images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 800
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "featureflags-prod-app"
    }

  # aws_ecr_repository.application_ecs_service_ecr-app_ecr-repo_ABFE17F0 will be created
  + resource "aws_ecr_repository" "application_ecs_service_ecr-app_ecr-repo_ABFE17F0" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "featureflags-prod-app"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + tags_all             = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecs_cluster.application_ecs_cluster_4DC6EFB3 will be created
  + resource "aws_ecs_cluster" "application_ecs_cluster_4DC6EFB3" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "FeatureFlags-Prod"
      + tags     = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + tags_all = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4 will be created
  + resource "aws_ecs_service" "application_ecs_service_ecs-service_A8BAB5F4" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "FeatureFlags-Prod"
      + platform_version                   = (known after apply)
      + propagate_tags                     = "SERVICE"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + tags_all                           = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_controller {
          + type = "CODE_DEPLOY"
        }

      + load_balancer {
          + container_name   = "app"
          + container_port   = 4242
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-610bdb3b",
              + "subnet-b2a036fa",
              + "subnet-cc66bde0",
              + "subnet-d09eb8ec",
            ]
        }
    }

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 will be created
  + resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "512"
      + execution_role_arn       = (known after apply)
      + family                   = "FeatureFlags-Prod"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = true
      + tags                     = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + tags_all                 = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + task_role_arn            = (known after apply)
    }

  # aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77 will be created
  + resource "aws_iam_policy" "application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "FeatureFlags-Prod-TaskExecutionRolePolicy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                          + "kms:Decrypt",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/*",
                          + "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared",
                          + "arn:aws:secretsmanager:us-east-1:996905175585:secret:FeatureFlags/Prod/*",
                          + "arn:aws:secretsmanager:us-east-1:996905175585:secret:FeatureFlags/Prod",
                          + "arn:aws:secretsmanager:us-east-1:996905175585:secret:FeatureFlags-Prod/*",
                          + "arn:aws:secretsmanager:us-east-1:996905175585:secret:FeatureFlags-Prod",
                          + "arn:aws:kms:us-east-1:996905175585:key/fee9bd90-a01f-4212-8b69-9c149a7cdb15",
                        ]
                    },
                  + {
                      + Action   = "ssm:GetParameter*"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:us-east-1:996905175585:parameter/FeatureFlags/Prod/*",
                          + "arn:aws:ssm:us-east-1:996905175585:parameter/FeatureFlags/Prod",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + tags_all    = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
    }

  # aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6 will be created
  + resource "aws_iam_policy" "application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "FeatureFlags-Prod-TaskRolePolicy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingStatisticSummaries",
                          + "xray:GetSamplingRules",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + tags_all    = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
    }

  # aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA will be created
  + resource "aws_iam_role" "application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "FeatureFlags-Prod-TaskExecutionRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + tags_all              = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED will be created
  + resource "aws_iam_role" "application_ecs_service_ecs-iam_ecs-task-role_A72990ED" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "FeatureFlags-Prod-TaskRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + tags_all              = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_175DB7D3 will be created
  + resource "aws_iam_role" "application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_175DB7D3" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codedeploy.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "FeatureFlags-Prod-ECSCodeDeployRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + tags_all              = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355 will be created
  + resource "aws_iam_role_policy_attachment" "application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E will be created
  + resource "aws_iam_role_policy_attachment" "application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF will be created
  + resource "aws_iam_role_policy_attachment" "application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_1A1D5725 will be created
  + resource "aws_iam_role_policy_attachment" "application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_1A1D5725" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSCodeDeployRoleForECS"
      + role       = "FeatureFlags-Prod-ECSCodeDeployRole"
    }

  # aws_rds_cluster.rds_rds_cluster_1A0399FD will be created
  + resource "aws_rds_cluster" "rds_rds_cluster_1A0399FD" {
      + allocated_storage               = (known after apply)
      + apply_immediately               = (known after apply)
      + arn                             = (known after apply)
      + availability_zones              = (known after apply)
      + backup_retention_period         = (known after apply)
      + cluster_identifier              = (known after apply)
      + cluster_identifier_prefix       = (known after apply)
      + cluster_members                 = (known after apply)
      + cluster_resource_id             = (known after apply)
      + copy_tags_to_snapshot           = true
      + database_name                   = "featureflags"
      + db_cluster_parameter_group_name = (known after apply)
      + db_subnet_group_name            = (known after apply)
      + db_system_id                    = (known after apply)
      + delete_automated_backups        = true
      + enable_global_write_forwarding  = false
      + enable_http_endpoint            = false
      + endpoint                        = (known after apply)
      + engine                          = "aurora-postgresql"
      + engine_mode                     = "serverless"
      + engine_version                  = (known after apply)
      + engine_version_actual           = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + iam_roles                       = (known after apply)
      + id                              = (known after apply)
      + kms_key_id                      = (known after apply)
      + master_password                 = (sensitive value)
      + master_user_secret              = (known after apply)
      + master_user_secret_kms_key_id   = (known after apply)
      + master_username                 = "pkt_fflags"
      + network_type                    = (known after apply)
      + port                            = (known after apply)
      + preferred_backup_window         = (known after apply)
      + preferred_maintenance_window    = (known after apply)
      + reader_endpoint                 = (known after apply)
      + skip_final_snapshot             = false
      + storage_encrypted               = (known after apply)
      + storage_type                    = (known after apply)
      + tags                            = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + tags_all                        = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + vpc_security_group_ids          = (known after apply)

      + scaling_configuration {
          + auto_pause               = false
          + max_capacity             = 16
          + min_capacity             = 2
          + seconds_until_auto_pause = 300
          + timeout_action           = "RollbackCapacityChange"
        }
    }

  # aws_route53_record.application_alb_certificate_certificate_record_51B45CF2 will be created
  + resource "aws_route53_record" "application_alb_certificate_certificate_record_51B45CF2" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # aws_route53_record.application_alb_record_8EA9D3F9 will be created
  + resource "aws_route53_record" "application_alb_record_8EA9D3F9" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "featureflags.readitlater.com"
      + set_identifier  = "1"
      + type            = "A"
      + zone_id         = (known after apply)

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }

      + weighted_routing_policy {
          + weight = 1
        }
    }

  # aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22 will be created
  + resource "aws_route53_record" "application_base_dns_subhosted_zone_ns_DFB88A22" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "featureflags.readitlater.com"
      + records         = (known after apply)
      + ttl             = 86400
      + type            = "NS"
      + zone_id         = "Z2BHWTOWFVNW3M"
    }

  # aws_route53_zone.application_base_dns_subhosted_zone_77521D1C will be created
  + resource "aws_route53_zone" "application_base_dns_subhosted_zone_77521D1C" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "featureflags.readitlater.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags                = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + tags_all            = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + zone_id             = (known after apply)
    }

  # aws_secretsmanager_secret.rds_rds_secret_A0401B27 will be created
  + resource "aws_secretsmanager_secret" "rds_rds_secret_A0401B27" {
      + arn                            = (known after apply)
      + description                    = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = (known after apply)
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + tags_all                       = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
    }

  # aws_secretsmanager_secret_version.rds_rds_secret_version_11D8C2B1 will be created
  + resource "aws_secretsmanager_secret_version" "rds_rds_secret_version_11D8C2B1" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_security_group.application_application_load_balancer_alb_security_group_7B45D070 will be created
  + resource "aws_security_group" "application_application_load_balancer_alb_security_group_7B45D070" {
      + arn                    = (known after apply)
      + description            = "External security group  (Managed by Terraform)"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "required"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "FeatureFlags-Prod-HTTP/S Security Group"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"        = "FeatureFlags-Prod-HTTP/S Security Group"
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + tags_all               = {
          + "Name"        = "FeatureFlags-Prod-HTTP/S Security Group"
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + vpc_id                 = "vpc-867638e3"
    }

  # aws_security_group.application_ecs_service_ecs_security_group_231C6B1E will be created
  + resource "aws_security_group" "application_ecs_service_ecs_security_group_231C6B1E" {
      + arn                    = (known after apply)
      + description            = "Internal ECS Security Group (Managed by Terraform)"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "required"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "required"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 4242
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "FeatureFlags-Prod-ECSSecurityGroup"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + tags_all               = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + vpc_id                 = "vpc-867638e3"
    }

  # aws_security_group.rds_rds_security_group_B7738CEB will be created
  + resource "aws_security_group" "rds_rds_security_group_B7738CEB" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "required"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "172.16.0.0/16",
                ]
              + description      = ""
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5432
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "FeatureFlags-Prod"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + tags_all               = {
          + "environment" = "Prod"
          + "service"     = "FeatureFlags"
        }
      + vpc_id                 = "vpc-867638e3"
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 45 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"58dc348e-5188-4cc8-a979-83c0505c29ad","JobName":"feature-flags_infrastructure_plan_prod","PRNumber":123,"Program":"tfcmt","SHA1":"577cb86345688683bf177732e35b93c7c6dfba97","Target":"feature-flags-cdk","Vars":{}} -->